#1 . Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

# a = 15

# b = 'строка'
# print(b)

# result = int(input('Введите число: '))
# print(result)

# 2. Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды
# и выведите в формате чч:мм:сс. Используйте форматирование строк.


entr = int(input("Введите время в секундах "))

hrs = entr // 3600
min = (entr - hrs * 3600) // 60
sec = entr - (hrs * 3600 + min * 60)

full_time = f"Ваше время:  {hrs} : {min} : {sec}"

full_time = f"Ваше время:  {hrs, 'часа'} : {min, 'минут'} : {sec, 'cекунд'}"
entr
print(f"Ваше время:  {hrs} : {min} : {sec}")

print(full_time)