# Спортсмен занимается ежедневными пробежками.
# В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 %
# относительно предыдущего.
# Требуется определить номер дня, на который общий
# результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и
# выводить одно натуральное число — номер дня.

a = float(input("Введите результаты 1 дня в км: "))
b = float(input("Введите желаемый результат в км: "))

days = 1
print(f"1 день {a: .3f}")

while a < b:
        a = a + 0.1 * a
        days += 1
        print(f'{days} день {a: .3f}')
print(f"На {days} день спортcмен достиг результата {b} км")