#  4. Пользователь вводит целое положительное число.
# Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.





# number =input('Введите число:  ')
# print(max(number))

num = int(input('Введите число: '))
max = 0
while num>0:
    x = num % 10
    if x >= max: max = x
    num //= 10
print(max)