# hm_2.2
# Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить
# на своем месте.
# Для заполнения списка элементов необходимо использовать
# функцию input().



# lst[b], lst[a] = lst[a], lst[b]

# a = list(input())

# a[::2], a[1::2] = a[1::2], a[::2]


lst = input('Введите значения списка через пробел: ')
lst = lst.split()

print(lst)

i = 0
for x in lst[1::2]:
    lst[i+1], lst[i] = lst[i], lst[i+1]
    i = i + 2
print(lst)