"""
Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия,
год рождения, город проживания, email, телефон.
Функция должна принимать параметры как именованные аргументы.
Реализовать вывод данных о пользователе одной строкой.
"""



name = input("Введите имя пользователя :  ")
surname = input("Введите фамилию пользователя :  ")
year = input("Введите год рождения :  ")
city = input("Введите город :  ")
email = input("Введите электронную почту :  ")
phone = input("Введите телефон :  ")

def my_func(name, surname, year, city, email, phone):
    return ' '.join([name, surname, year, city, email, phone])

data = my_func(name, surname, year, city, email, phone)

print(f'Данные пользователя: {data}')






